import {
  Item,
  ItemList,
  ItemListTitle,
  ItemNumberList,
  ItemTitle,
  List,
  ListsContainer,
} from "./OtherServices.styled";

const MobList = () => {
  return (
    <ListsContainer>
      <List>
        <Item>
          <ItemTitle>Підготовка бізнесу до залучення фінансування</ItemTitle>
          <ItemNumberList>
            <li>
              <ItemListTitle>Юридичний аудит:</ItemListTitle>
              <ItemList>
                <li>
                  Перевірка корпоративної структури, договірної бази, прав на
                  активи та інтелектуальну власність.
                </li>
                <li>
                  Усунення юридичних ризиків, які можуть відлякати інвесторів.
                </li>
              </ItemList>
            </li>
            <li>
              <ItemListTitle>
                Оптимізація корпоративної структури:
              </ItemListTitle>
              <ItemList>
                <li>
                  Перереєстрація бізнесу або створення холдингової компанії у
                  сприятливій юрисдикції.
                </li>
                <li>
                  Вибір моделі розподілу часток між співзасновниками та
                  інвесторами.
                </li>
              </ItemList>
            </li>
          </ItemNumberList>
        </Item>
        <Item>
          <ItemTitle>Складання інвестиційної документації</ItemTitle>
          <ItemNumberList>
            <li>
              <ItemListTitle>
                Term Sheet: основні умови майбутньої угоди, включаючи суми
                інвестицій, оцінку компанії (pre-money/post-money), права
                інвестора.
              </ItemListTitle>
            </li>
            <li>
              <ItemListTitle>Договір інвестування:</ItemListTitle>
              <ItemList>
                <li>
                  Інструменти фінансування: акції, облігації, конвертовані
                  позики.
                </li>
                <li>
                  Положення про захист інтересів інвестора (Drag-Along,
                  Tag-Along, Liquidation Preference).
                </li>
              </ItemList>
            </li>
            <li>
              <ItemListTitle>
                Акціонерна угода (Shareholders’ Agreement):
              </ItemListTitle>
              <ItemList>
                <li>Розподіл повноважень між сторонами, права голосу.</li>
                <li>
                  Умови виходу з бізнесу для інвесторів та співзасновників.
                </li>
              </ItemList>
            </li>
          </ItemNumberList>
        </Item>
        <Item>
          <ItemTitle>Супровід угод із фінансування</ItemTitle>
          <ItemNumberList>
            <li>
              <ItemListTitle>Due Diligence з боку інвесторів:</ItemListTitle>
              <ItemList>
                <li>
                  Підготовка та надання інвестору юридичних, фінансових,
                  технічних документів.
                </li>
                <li>
                  Підготовка і погодження умов із фінансовими установами,
                  фондами, приватними інвесторами.
                </li>
                <li>
                  Аналіз ризиків та відповідності діяльності бізнесу вимогам
                  законодавства
                </li>
              </ItemList>
            </li>
            <li>
              <ItemListTitle>
                Супровід після залучення фінансування
              </ItemListTitle>
              <ItemList>
                <li>
                  Юридична підтримка корпоративного управління:
                  <ItemList>
                    <li>
                      Внесення змін до статуту, реєстрація нових акціонерів.
                    </li>
                    <li>
                      Управління правами інвесторів, включаючи наглядові
                      функції.
                    </li>
                  </ItemList>
                </li>
                <li style={{ marginTop: "20px" }}>
                  Виконання умов інвестиційної угоди:
                  <ItemList>
                    <li>Супровід звітності перед інвесторами.</li>
                    <li>
                      Підтримка дотримання корпоративних політик і процедур.
                    </li>
                  </ItemList>
                </li>
              </ItemList>
            </li>
          </ItemNumberList>
        </Item>
        <Item>
          <ItemTitle>Послуги адвоката</ItemTitle>
          <ItemNumberList>
            <li>
              <ItemListTitle>Захист у кримінальних справах</ItemListTitle>
              <ItemList>
                <li>
                  Представництво обвинувачених, потерпілих або свідків у суді.
                </li>
                <li>Захист під час допитів, обшуків, оглядів, затримання.</li>
              </ItemList>
            </li>
            <li>
              <ItemListTitle>Судове представництво</ItemListTitle>
              <ItemList>
                <li>Підготовка позовів, скарг, клопотань.</li>
                <li>
                  Участь у судових засіданнях у цивільних, адміністративних і
                  господарських справах.
                </li>
              </ItemList>
            </li>
            <li>
              <ItemListTitle>Податкові спори</ItemListTitle>
              <ItemList>
                <li>Оскарження рішень податкових органів.</li>
                <li>Консультації щодо оптимізації оподаткування.</li>
              </ItemList>
            </li>
            <li>
              <ItemListTitle>Форс-мажори та захист активів</ItemListTitle>
              <ItemList>
                <li>Врегулювання кризових ситуацій, рейдерських атак.</li>
                <li>
                  Представництво під час арештів майна чи блокування рахунків.
                </li>
                <li>
                  Захист під час перевірок і врегулювання спорів із
                  контрагентами.
                </li>
                <li>
                  Отримання інформації від державних органів шляхом направлення
                  адвокатського запиту
                </li>
              </ItemList>
            </li>
          </ItemNumberList>
        </Item>
        <Item>
          <ItemTitle>Фінансовий супровід ІТ компанії:</ItemTitle>
          <ItemList>
            <li>
              Підготовка та аналіз фінансових звітів, що включають рух коштів,
              прибутки та збитки, а також фінансовий баланс компанії.
            </li>
            <li>
              Аналітичні звіти ключових показників, для відслідковування
              динаміки бізнесу і прийняття управлінських рішень.
            </li>
            <li>
              Розробка фінансової моделі, що дозволяє прогнозувати доходи,
              витрати та інвестиційні потреби для бізнесу. Бюджетування
              діяльності.
            </li>
            <li>
              Створення панелей для моніторингу основних фінансових та
              операційних показників для прийняття управлінських рішень.
            </li>
            <li>
              Підготовка регулярних фінансових звітів для інвесторів, що
              включають інформацію про результати діяльності та прогнози для
              підтримки довіри та залучення інвестицій.
            </li>
            <li>
              Визначення та обчислення гонорарів для співробітників,
              консультантів або підрядників відповідно до умов контрактів та
              вимог бізнесу.
            </li>
            <li>Прогнозування і моніторинг грошових потоків.</li>
            <li>
              Розробка системи управління заборгованістю та зобов&apos;язаннями.
            </li>
            <li>
              Контроль надходжень від клієнтів та управління виплатами
              постачальникам.
            </li>
            <li>
              Координація та забезпечення проведення фінансового аудиту для
              зовнішньої незалежної перевірки діяльності бізнесу.
            </li>
            <li>
              Створення стандартів і процедур для управління фінансами
              (інвойсинг, контроль витрат, управління дебіторською/кредиторською
              заборгованістю).
            </li>
            <li>
              Впровадження фінансового обліку та автоматизація фінансових
              процесів.
            </li>
            <li>
              Підготовка звітності і розрахунків необхідних для конкретного
              запиту.
            </li>
          </ItemList>
        </Item>
      </List>
    </ListsContainer>
  );
};

export default MobList;
