import BuyBtn from "@/components/Buttons/BuyBtn/BuyBtn";
import {
  Item,
  ItemList,
  ItemListBottomText,
  ItemListTitle,
  ItemNumberList,
  ItemPrice,
  ItemPriceBottomText,
  ItemTitle,
  List,
} from "./PackageServices.styled";
import OrderBtn from "@/components/Buttons/OrderBtn/OrderBtn";

const MobList = ({ modal }) => {
  return (
    <List>
      <Item>
        <ItemTitle>СТВОРЕННЯ ЮРИДИЧНОЇ МОДЕЛІ БІЗНЕСУ</ItemTitle>
        <div>
          <ItemList>
            <li>Вибір оптимальної юрисдикції</li>
            <li>Підготовка установчих документів</li>
            <li>Реєстрація компанії</li>
            <li>Відкриття рахунку</li>
            <li>Отримання свідоцтв/ліцензій</li>
            <li>
              Оптимізація податкових витрат відповідно до діяльності бізнесу.
            </li>
            <li>Розробка типових договорів для ІТ-бізнесу:</li>
          </ItemList>

          <ItemNumberList>
            <li>Контракти з клієнтами (B2B, B2C).</li>
            <li>Угоди з працівниками та підрядниками (зокрема, NDA, NCA).</li>
            <li>Ліцензійні угоди, SLA (Service Level Agreement).</li>
          </ItemNumberList>
          <ItemList>
            <li>
              Створення політик щодо захисту персональних даних (GDPR/CCPA).
            </li>
            <li>
              Врегулювання питань інтелектуальної власності (передача прав на
              програмне забезпечення, реєстрація торгових марок, патентів,
              авторських прав).
            </li>
            <li>Побудова договірної та організаційної структури.</li>
            <li>Забезпечення відповідності законодавчим вимогам.</li>
          </ItemList>
        </div>
        <ItemPrice>від 80 000 грн</ItemPrice>
        <OrderBtn>Замовити консультацію</OrderBtn>
      </Item>
      <Item>
        <ItemTitle>ЮРИДИЧНИЙ СУПРОВІД ІТ-КОМПАНІЇ</ItemTitle>
        <ItemListTitle>Пакет &quot;Базовий ІТ-супровід&quot;</ItemListTitle>
        <div>
          <ItemList>
            <li>
              Юридичні консультації з ІТ-права: Консультації з питань
              нормативних вимог та первинні рекомендації.
            </li>
            <li>
              Договори та угоди: Підготовка та погодження з контрагентами
              базових договорів, таких як NDA, контракти для аутсорсингу та
              розробки ПЗ.
            </li>
            <li>
              Аналіз ліцензій: Перевірка відповідності ліцензій на використання
              програмного забезпечення.
            </li>
            <li>
              Конфіденційність і захист даних: Огляд політик конфіденційності
              відповідно до місцевого законодавства.
            </li>
            <li>
              Реєстрація інтелектуальної власності: Юридичний супровід процесу
              реєстрації торгових марок та авторських прав.
            </li>
          </ItemList>
          <ItemListBottomText>
            В пакет послуг входить до 15 годин роботи нашого ІТ-юриста, котрий
            буде завжди з вами на зв&apos;язку.
          </ItemListBottomText>
        </div>
        <div>
          <ItemPrice>22 000 грн</ItemPrice>
          <ItemPriceBottomText>
            до 15 людино-годин роботи на місяць
          </ItemPriceBottomText>
        </div>

        <BuyBtn onOrderBtn={modal}>придбати пакет</BuyBtn>
      </Item>
      <Item>
        <ItemTitle>ЮРИДИЧНИЙ СУПРОВІД ІТ-КОМПАНІЇ</ItemTitle>
        <ItemListTitle>
          Пакет &quot;Повний правовий супровід ІТ-бізнесу&quot;
        </ItemListTitle>
        <div>
          <ItemList>
            <li>Всі послуги, що включені до “Базового IT-супроводу”.</li>
            <li>
              Розширені юридичні консультації: Питання щодо інтелектуальної
              власності, патентів та товарних знаків.
            </li>
            <li>
              Розробка та аудит складних договорів: Ліцензійні угоди,
              партнерські договори, SaaS-контракти.
            </li>
            <li>
              Міжнародне консультування: Підтримка для ІТ-компаній, що працюють
              за кордоном, включаючи податкове планування та захист даних згідно
              з GDPR.
            </li>
            <li>
              Підтримка юридичної моделі стартапу: Консультації щодо реєстрації
              компанії, структурування бізнесу, підготовка до інвестицій та
              підтримка M&A угод.
            </li>
            <li>
              Юридичний супровід розробки та запуску продуктів: Аналіз правових
              аспектів та оцінка можливих ризиків.
            </li>
          </ItemList>
          <ItemListBottomText>
            В пакет послуг входить до 40 годин роботи нашого ІТ-юриста, котрий
            знайде спосіб вирішити будь-яке юридичне питання вашого ІТ бізнесу.
          </ItemListBottomText>
        </div>
        <div>
          <ItemPrice>60 000 грн</ItemPrice>
          <ItemPriceBottomText>
            до 40 людино-годин роботи на місяць
          </ItemPriceBottomText>
        </div>

        <BuyBtn onOrderBtn={modal}>придбати пакет</BuyBtn>
      </Item>
      <Item>
        <ItemTitle>ПОДАННЯ ЗВІТУ КІК</ItemTitle>
        <div>
          <ItemList>
            <li>
              Оцінка необхідності подання звіту залежно від юрисдикції компанії
              та резидентства клієнта.
            </li>
            <li>
              Аналіз структури володіння КІК та ролі клієнта (кінцевий
              бенефіціар, контролер).
            </li>
            <li>
              Аналіз фінансових звітів КІК відповідно до міжнародних стандартів
              (IFRS, GAAP).
            </li>
            <li>
              Обчислення податку на прибуток КІК, який підлягає декларуванню в
              країні клієнта.
            </li>
            <li>
              Оптимізація податкового навантаження (з урахуванням угод про
              уникнення подвійного оподаткування).
            </li>
            <li>
              Формування звіту про КІК відповідно до вимог податкового
              законодавства.
            </li>
            <li>Заповнення декларації та подання її до податкових органів.</li>
          </ItemList>
        </div>
        <ItemPrice>від 30 000 грн</ItemPrice>
        <OrderBtn>Замовити консультацію</OrderBtn>
      </Item>
      <Item>
        <ItemTitle>ПАКЕТ ДОКУМЕНТІВ ДЛЯ ПІДТРИМКИ ІТ КОМПАНІЇ</ItemTitle>
        <div>
          <ItemList>
            <li>Договір про нерозголошення конфіденційної інформації (NDA)</li>
            <li>Договір про неконкуренцію (NCA)</li>
            <li>Договір про надання послуг</li>
            <li>Акт приймання-передачі</li>
            <li>Рахунок</li>
          </ItemList>
        </div>
        <ItemPrice>5 000 грн</ItemPrice>
        <BuyBtn onOrderBtn={modal}>придбати пакет</BuyBtn>
      </Item>
      <Item>
        <ItemTitle>
          ПАКЕТ ДОКУМЕНТІВ ФРІЛАНСЕРА ДЛЯ РОБОТИ З КЛІЄНТАМИ
        </ItemTitle>
        <div>
          <ItemList>
            <li>
              Шаблон договору про надання послуг фрілансера (для українського та
              закордонного клієнта)
            </li>
            <li>Шаблон акту приймання-передачі наданих послуг</li>
            <li>Шаблон рахунку</li>
          </ItemList>
        </div>
        <ItemPrice>1 000 грн</ItemPrice>
        <BuyBtn onOrderBtn={modal}>придбати пакет</BuyBtn>
      </Item>
      <Item>
        <ItemTitle>
          СТРАТЕГІЧНА СЕСІЯ З РОАДМАПОМ РЕАЛІЗАЦІЇ ПОГОДЖЕНОЇ СТРАТЕГІЇ
        </ItemTitle>
        <div>
          <ItemList>
            <li>
              Аналізу поточного стану компанії (оцінка ринку, конкурентного
              середовища, внутрішніх ресурсів, фінансових показників).
            </li>
            <li>
              Формування бачення майбутнього спільно зі стейкхолдерами бізнесу.
            </li>
            <li>Визначення цілей, пріоритетів і шляхів їх реалізації.</li>
            <li>
              Розробка детального роадмапу реалізації стратегії, визначення
              відповідальних осіб, термінів виконання поставлених задач та
              метрик успіху.
            </li>
          </ItemList>
        </div>
        <ItemPrice>від 50 000 грн</ItemPrice>
        <OrderBtn>Замовити консультацію</OrderBtn>
      </Item>
    </List>
  );
};

export default MobList;
